app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", "5"], ["created_at", "2019-02-20 18:58:33.192025"], ["updated_at", "2019-02-20 18:58:33.192025"]]
---
  def create
      @school_class = SchoolClass.new
  	  @school_class.title = params[:title]
  	  @school_class.room_number = params[:room_number]
  	  @school_class.save